Tekla.Structures.Model.Welding.WeldSeamPositionEnum
Weld seam position types.

Tekla.Structures.Model.Welding.WeldSeamPositionEnum.SEAM_ABOVE
Seam above.

Tekla.Structures.Model.Welding.WeldSeamPositionEnum.SEAM_BELOW
Seam below.